# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [7]:
import pandas as pd
import numpy as np

In [8]:
# Series
s = pd.Series([100, 200, 300], index=['a', 'b', 'c'])

# DataFrame
df = pd.DataFrame({'Sales': [100, 200, 300]}, index=['a', 'b', 'c'])

In [9]:
print(s)
print(df)

a    100
b    200
c    300
dtype: int64
   Sales
a    100
b    200
c    300

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [10]:
a = pd.Series([ 100, 200, 300, 400])

Print a, and data type

In [11]:
print(a)
print(a.dtype)

0    100
1    200
2    300
3    400
dtype: int64
int64

Using indexing access the element 300 from the series a.

In [12]:

print(a[2])

300

What are the values of index for series a?

In [13]:
0, 1, 2, 3

(0, 1, 2, 3)

Change the index to  ['c', 'a', 'b', 'd']

In [14]:


a = pd.Series([100, 200, 300, 400], index=['c', 'a', 'b', 'd'])
print(a)

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [15]:

print(a['d'])

400

Sort the values wrt to the index and print it

In [16]:
a = pd.Series([100, 200, 300, 400], index=['c', 'a', 'b', 'd'])
sorted_a = a.sort_index()
print(sorted_a)

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [17]:
# b =

b = pd.Series([800,450,100], index = ['e', 'f', 'g'])
print(b)

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [18]:
# a =

a = pd.concat([a, b])
a = a.sort_index
print(a)

<bound method Series.sort_index of c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64>

In [19]:
#print a again after appending b into it

print(a)

<bound method Series.sort_index of c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64>

Sort the values in descending order of a and print the index of the sorted series

In [20]:
# a =
a = pd.Series([200, 300, 400, 800, 450, 100], 
              index=['a', 'b', 'd', 'e', 'f', 'g'])
a = a.sort_values(ascending=False)
print(a)

e    800
f    450
d    400
b    300
a    200
g    100
dtype: int64

In [21]:

print(a.index)

Index(['e', 'f', 'd', 'b', 'a', 'g'], dtype='object')

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [22]:
 df_1= pd.DataFrame([200,300,400,500,600,700,800],index=['a', 'b', 'c','d', 'e', 'f', 'g'])

In [23]:
print(a)

e    800
f    450
d    400
b    300
a    200
g    100
dtype: int64

What is the shape of the datafarme <br>
(also, what does it imply?)

In [24]:
print(a.shape)

(6,)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [25]:
# yep its same as the series.

same

NameError: name 'same' is not defined

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [ ]:

print(a.head())

     0
a  200
b  300
c  400
d  500
e  600

In [ ]:
print(a.tail())

     0
c  400
d  500
e  600
f  700
g  800

Rename the column of the dataframe as 'points'

In [ ]:
points = a

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [ ]:
#Create fruits array
import random
fruit_choices = ['orange','mango','apple']

In [ ]:
#Create series fruits out of fruits array

# fruits =
fruits = pd.Series(random.choices(fruit_choices, k =7), index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])

print(fruits)

a     mango
b     apple
c     apple
d    orange
e     apple
f     mango
g     apple
dtype: object

Change the index of fruits to the index of dataframe df

In [ ]:
fruits.index = a.index

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [ ]:

import pandas as pd
import random

# Sample list of fruits to choose from
fruit_choices = ['Apple', 'Banana', 'Orange', 'Grapes', 'Mango']

# Create the DataFrame and Series
df = pd.DataFrame([200, 300, 400, 500, 600, 700, 800], index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])
fruits = pd.Series(random.choices(fruit_choices, k=7), index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])

# Print the fruits Series
print(fruits)

# Add the fruits series as a new column to the DataFrame
df['fruits'] = fruits

# Print the head of the DataFrame to verify
print(df.head())

a    Orange
b    Orange
c    Grapes
d    Orange
e     Apple
f    Orange
g     Mango
dtype: object
     0  fruits
a  200  Orange
b  300  Orange
c  400  Grapes
d  500  Orange
e  600   Apple

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [26]:
# d1 =
data = {
    'city': ['chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali'],
    'Temperature' : [15,22,20, 26, -2]}
d1 = pd.DataFrame(data)

Print(d1)

In [ ]:

print(d1)

         city  Temperature
0  chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [ ]:

print(d1.shape)

(5, 2)

Set city = d1['city']

In [ ]:

city = d1['city']

print city <br>
What is the type of city.

In [ ]:
print(type(city))

<class 'pandas.core.series.Series'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [29]:
#d2 =

data_2 = {
    'city': ['Bengalore', 'Coimbatore', 'Srirangam', 'pondicherry'],
    'Temperature': [24, 35, 36, 39] 
}

d2 = pd.DataFrame(data_2)

print the shape of this dataframe

In [ ]:
print(d2.shape)

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [30]:
# d3 =

d3 = pd.concat([d1,d2], ignore_index = True)
print(d3)

          city  Temperature
0   chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
5    Bengalore           24
6   Coimbatore           35
7    Srirangam           36
8  pondicherry           39

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [ ]:
filtered = d3[d3['Temperature']<=20]

print(filtered)

         city  Temperature
0  chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [ ]:
filtered_2 = d3[d3['Temperature']>=35]
print(filtered_2)

          city  Temperature
6   Coimbatore           35
7    Srirangam           36
8  pondicherry           39

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not.
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [ ]:
# write function here

def is_ut(city_name):
    return city_name.lower() in ['chandigarh','pondicherry', 'delhi']

d3['is_ut'] = d3['city'].apply(is_ut)

In [ ]:
print(d3)

          city  Temperature  is_ut  is_union_territory
0   chandigarh           15   True                True
1        Delhi           22   True                True
2       Kanpur           20  False               False
3      Chennai           26  False               False
4       Manali           -2  False               False
5    Bengalore           24  False               False
6   Coimbatore           35  False               False
7    Srirangam           36  False               False
8  pondicherry           39   True                True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT -
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [ ]:
# write function here

def c_to_f(c):
    farenhiet = (c*9/5) +32
    return farenhiet

In [ ]:
# check function c_to_f(10)

c_to_f(10)

50.0

In [32]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

d3['temp_fahrenheit'] = d3['Temperature'].apply(c_to_f)
print(d3)

          city  Temperature  temp_fahrenheit
0   chandigarh           15             59.0
1        Delhi           22             71.6
2       Kanpur           20             68.0
3      Chennai           26             78.8
4       Manali           -2             28.4
5    Bengalore           24             75.2
6   Coimbatore           35             95.0
7    Srirangam           36             96.8
8  pondicherry           39            102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [33]:

# List of UT cities (in lowercase for case-insensitive comparison)
ut_cities = ['chandigarh', 'delhi', 'pondicherry']

# Filter the dataframe for UT cities (case-insensitive match)
d1_ut = d3[d3['city'].str.lower().isin(ut_cities)]

# Display result
print(d1_ut)

          city  Temperature  temp_fahrenheit
0   chandigarh           15             59.0
1        Delhi           22             71.6
8  pondicherry           39            102.2

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [38]:

filtered = d3[d3['temp_fahrenheit']>=90]
print(filtered)

          city  Temperature  temp_fahrenheit
6   Coimbatore           35             95.0
7    Srirangam           36             96.8
8  pondicherry           39            102.2

Select only the first three rows of the dataframe d1.

In [39]:
print(d3.head(3))

         city  Temperature  temp_fahrenheit
0  chandigarh           15             59.0
1       Delhi           22             71.6
2      Kanpur           20             68.0

Select all the rows and last two columns in the dataframe.

In [41]:
subset = d3.iloc[:,-2:]
print(subset)

   Temperature  temp_fahrenheit
0           15             59.0
1           22             71.6
2           20             68.0
3           26             78.8
4           -2             28.4
5           24             75.2
6           35             95.0
7           36             96.8
8           39            102.2

## Groupby

In [42]:
# Create a dataframe using dictionary of your choice

data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'David', 'Eve', 'Charlie', 'Eve'],
    'Department': ['Sales', 'Sales', 'HR', 'Sales', 'Sales', 'HR', 'IT', 'HR', 'IT'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'South', 'North'],
    'Sales': [2500, 2700, 1800, 3000, 2600, 2200, 3100, 1900, 3300]
}

df = pd.DataFrame(data)

print(df)

  Employee Department Region  Sales
0    Alice      Sales  North   2500
1      Bob      Sales  South   2700
2  Charlie         HR  North   1800
3    Alice      Sales  South   3000
4      Bob      Sales  North   2600
5    David         HR  South   2200
6      Eve         IT  North   3100
7  Charlie         HR  South   1900
8      Eve         IT  North   3300

In [43]:
# Use Groupby of single column with aggregate sum()

df.groupby('Department').sum()

                       Employee                Region  Sales
Department
HR          CharlieDavidCharlie       NorthSouthSouth   5900
IT                       EveEve            NorthNorth   6400
Sales          AliceBobAliceBob  NorthSouthSouthNorth  10800

In [44]:
# Use Groupby of single column with aggregate count()

df.groupby('Department').count()

            Employee  Region  Sales
Department
HR                 3       3      3
IT                 2       2      2
Sales              4       4      4

In [56]:
# Use Groupby of single column with aggregate min() and max()
df.groupby('Department')['Sales'].min()

Department
HR       1800
IT       3100
Sales    2500
Name: Sales, dtype: int64

In [57]:
df.groupby('Department')['Sales'].max()

Department
HR       2200
IT       3300
Sales    3000
Name: Sales, dtype: int64

In [50]:
# Use Groupby of any 2 columns with aggregate mean()

df.groupby('Region')['Sales'].mean()

Region
North    2660.0
South    2450.0
Name: Sales, dtype: float64

In [ ]:
# Use Groupby of any 2 columns with aggregate min() and max()

df.groupby('Department')['Sales'].min()

            Sales
Department
HR           2200
IT           3300
Sales        3000

In [55]:
df.groupby('Department')[['Sales']].max()

            Sales
Department
HR           2200
IT           3300
Sales        3000

In [58]:
df.groupby('Department')['Sales'].agg(['min', 'max'])

             min   max
Department
HR          1800  2200
IT          3100  3300
Sales       2500  3000